In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.arange(0,30).reshape(5,6),index=['Row1','Row2','Row3','Row4','Row5'], columns=["Column1", "Colomn2", "Column3","Colums4","Column5","Column6"])

In [3]:
df.head()

      Column1  Colomn2  Column3  Colums4  Column5  Column6
Row1        0        1        2        3        4        5
Row2        6        7        8        9       10       11
Row3       12       13       14       15       16       17
Row4       18       19       20       21       22       23
Row5       24       25       26       27       28       29

In [4]:
df.to_csv('test1.csv')

In [5]:
df1 = pd.DataFrame(np.arange(0,35).reshape(5,7), index= ['row1','row2','row3','row4','row5'], columns= ['c1','c2','c3','c4','c5','c6','c7'])

In [6]:
df1.head()

      c1  c2  c3  c4  c5  c6  c7
row1   0   1   2   3   4   5   6
row2   7   8   9  10  11  12  13
row3  14  15  16  17  18  19  20
row4  21  22  23  24  25  26  27
row5  28  29  30  31  32  33  34

In [7]:
df1.tail()

      c1  c2  c3  c4  c5  c6  c7
row1   0   1   2   3   4   5   6
row2   7   8   9  10  11  12  13
row3  14  15  16  17  18  19  20
row4  21  22  23  24  25  26  27
row5  28  29  30  31  32  33  34

In [8]:
df1.to_csv('test2.csv')

In [9]:
df.loc['Row1']

Column1    0
Colomn2    1
Column3    2
Colums4    3
Column5    4
Column6    5
Name: Row1, dtype: int64

In [10]:
type(df.loc['Row1'])

pandas.core.series.Series

In [11]:
df.iloc[:,:]

      Column1  Colomn2  Column3  Colums4  Column5  Column6
Row1        0        1        2        3        4        5
Row2        6        7        8        9       10       11
Row3       12       13       14       15       16       17
Row4       18       19       20       21       22       23
Row5       24       25       26       27       28       29

In [12]:
df.iloc[0:3,0:2]

      Column1  Colomn2
Row1        0        1
Row2        6        7
Row3       12       13

In [13]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [14]:
df1.iloc[:,1:].values

array([[ 1,  2,  3,  4,  5,  6],
       [ 8,  9, 10, 11, 12, 13],
       [15, 16, 17, 18, 19, 20],
       [22, 23, 24, 25, 26, 27],
       [29, 30, 31, 32, 33, 34]])

In [16]:
df = pd.read_csv('test1.csv')

In [18]:
df.head(2)

  Unnamed: 0  Column1  Colomn2  Column3  Colums4  Column5  Column6
0       Row1        0        1        2        3        4        5
1       Row2        6        7        8        9       10       11

In [19]:
df.head()

  Unnamed: 0  Column1  Colomn2  Column3  Colums4  Column5  Column6
0       Row1        0        1        2        3        4        5
1       Row2        6        7        8        9       10       11
2       Row3       12       13       14       15       16       17
3       Row4       18       19       20       21       22       23
4       Row5       24       25       26       27       28       29

In [21]:
df.dtypes

Unnamed: 0    object
Column1        int64
Colomn2        int64
Column3        int64
Colums4        int64
Column5        int64
Column6        int64
dtype: object

In [22]:
df.describe()

         Column1    Colomn2    Column3    Colums4    Column5    Column6
count   5.000000   5.000000   5.000000   5.000000   5.000000   5.000000
mean   12.000000  13.000000  14.000000  15.000000  16.000000  17.000000
std     9.486833   9.486833   9.486833   9.486833   9.486833   9.486833
min     0.000000   1.000000   2.000000   3.000000   4.000000   5.000000
25%     6.000000   7.000000   8.000000   9.000000  10.000000  11.000000
50%    12.000000  13.000000  14.000000  15.000000  16.000000  17.000000
75%    18.000000  19.000000  20.000000  21.000000  22.000000  23.000000
max    24.000000  25.000000  26.000000  27.000000  28.000000  29.000000

In [25]:
type(df.dtypes)

pandas.core.series.Series

In [26]:
df.dtypes == 'object'

Unnamed: 0     True
Column1       False
Colomn2       False
Column3       False
Colums4       False
Column5       False
Column6       False
dtype: bool

In [27]:
df.dtypes[df.dtypes == 'int'].index

Index(['Column1', 'Colomn2', 'Column3', 'Colums4', 'Column5', 'Column6'], dtype='object')

In [29]:
df[df.dtypes[df.dtypes == 'int'].index].describe()

         Column1    Colomn2    Column3    Colums4    Column5    Column6
count   5.000000   5.000000   5.000000   5.000000   5.000000   5.000000
mean   12.000000  13.000000  14.000000  15.000000  16.000000  17.000000
std     9.486833   9.486833   9.486833   9.486833   9.486833   9.486833
min     0.000000   1.000000   2.000000   3.000000   4.000000   5.000000
25%     6.000000   7.000000   8.000000   9.000000  10.000000  11.000000
50%    12.000000  13.000000  14.000000  15.000000  16.000000  17.000000
75%    18.000000  19.000000  20.000000  21.000000  22.000000  23.000000
max    24.000000  25.000000  26.000000  27.000000  28.000000  29.000000

In [30]:
data = {'Name' : ["Alice" , "Bob" , "Claire"],
        'Age' : [25,30,27],
        'Gender':["Female" , "Male", "Female"]
        }
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [32]:
df[df.dtypes[df.dtypes == 'object'].index].describe()

         Name  Gender
count       3       3
unique      3       2
top     Alice  Female
freq        1       2

In [35]:
df.dtypes[df.dtypes == 'int'].index

Index(['Age'], dtype='object')

In [37]:
df[df.dtypes[df.dtypes == 'int'].index].describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [40]:
df['new_col'] = [3,4,7]

In [41]:
df.head()

     Name  Age  Gender  new_col
0   Alice   25  Female        3
1     Bob   30    Male        4
2  Claire   27  Female        7

In [42]:
df['new_col1'] = df['Name'] + df['Gender']

In [43]:
df

     Name  Age  Gender  new_col      new_col1
0   Alice   25  Female        3   AliceFemale
1     Bob   30    Male        4       BobMale
2  Claire   27  Female        7  ClaireFemale

In [44]:
pd.Categorical(df['Name'])

['Alice', 'Bob', 'Claire']
Categories (3, object): ['Alice', 'Bob', 'Claire']

In [46]:
df["Age"] >25

0    False
1     True
2     True
Name: Age, dtype: bool

In [47]:
df[df["Age"] >25]

     Name  Age  Gender  new_col      new_col1
1     Bob   30    Male        4       BobMale
2  Claire   27  Female        7  ClaireFemale

In [50]:
len(df[df["Age"] >27])

1

In [51]:
len(df) - len(df[df["Age"] >27])

2

In [52]:
max(df['Age'])

30